# Задача 1. Приветствие.
# Условие. Напишите программу, запрашивающую у пользователя его имя.
# В ответ на ввод на экране должно появиться приветствие с обращением по имени, введенному с клавиатуры ранее.

# Решение
name = input("Введите ваше имя пожалуйста: ")
print("Добро пожаловать на курс", name)
